Can't project Analytical Model. Two or more projection planes are parallel.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ProjectionPlanesParallel { get; }
  Visual Basic
Public Shared ReadOnly Property ProjectionPlanesParallel As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ProjectionPlanesParallel {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AnalyticalModelFailures Class
  Autodesk.Revit.DB Namespace